{
  "research": [
    {
      "id": 1,
      "research_name": "Designing a Photorealistic Simulation Platform for Robust Semantic Segmentation in Autonomous Vehicles",
      "company": [
        "Fulbright University Vietnam"
      ],
      "instructor": [
        "Dr. Dang Huynh"
      ],
      "project": "",
      "collaborators": [],
      "abstract": [
        "This capstone project proposes a comprehensive pipeline and foundational framework for de- veloping autonomous driving systems. The primary contribution is the creation of a high-fidelity simulation platform designed to generate realistic urban environments for testing and training au- tonomous driving models. As a part of this platform, semantic segmentation is demonstrated as one example of an application that benefits from simulated data. The platform enables the genera- tion of synthetic images under varying real-world conditions, facilitating the training of models for tasks such as object detection and scene understanding. The project also addresses challenges like class imbalance, offering insights and solutions for improving model performance in this context. The results highlight the potential of using simulated environments as a cost-effective and scalable approach for developing and testing autonomous driving applications. Further recommendations for refining the platform include incorporating real-world data, improving model generalization, and enhancing segmentation accuracy for deployment in real-time driving scenarios."
      ],
      "keywords": [
        "Machine Learning, Computer Vision, Autonomous Driving"
      ],
      "href": {
        "Github": "https://github.com/PhuongAnh2212/capstone-project",
        "Contributed Dataset": "https://www.kaggle.com/datasets/pdphanh/ue-city-dataset",
        "File": "public/capstone-thesis.pdf"
      },
      "status": "Completed"
    },
    {
      "id": 2,
      "research_name": "Understanding User Sentiment and Identity Factors in Reviews of Meta’s Threads App",
      "company": [
        "Fulbright University Vietnam"
      ],
      "instructor": [
        "Dr. Trung Phan"
      ],
      "project": "Computational Social Media",
      "collaborators": [
        "Uyen Truong", "Hieu Hoang", "Hoang Tran", "Nguyen Nguyen",
        "Khiem Tran"
      ],
      "abstract": [
        "Investigates the psychological underpinnings and sentiment patterns of user reviews for social media applications, with a focus on Threads. Through a mixed-methods approach combining qualitative coding and quantitative analysis, we identified linguistic markers that reflect user regret, platform comparison, and deeper psychological drivers such as autonomy, control, social belonging, and novelty seeking. Regret and comparison markers were found in a substantial number of reviews, with a small subset showing dissonance through the presence of both. Identity-linked terms such as Twitter, Instagram, data, and privacy were strongly associated with review sentiment, as confirmed by a chi-squared test. Additionally, psychological drivers were differentially expressed by sentiment polarity, with autonomy and      control concerns dominating negative reviews and social belonging       frequently emerging in positive ones. These findings offer insights     into how users cognitively and emotionally evaluate platforms, and      they provide design implications for improving user satisfaction in     social media apps."
      ],
      "keywords": [
        "Deep Learning",
        "Sentiment",
        "Nature Language Processing"
      ],
      "href": {
        "File": "https://drive.google.com/file/d/1qWfip-aEVXsvwaZd-WUjdSRi8yyeCjpx/view?usp=sharing"
      },
      "status": "Completed"
    }
  ]
}
